tutorials/multiRegion/film/cylinderDripping/constant/film/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

filmCloudTransfer
{
    type    filmCloudTransfer;

    ejection
    {
        model   dripping;
        // model   BrunDripping;
        // model   curvatureSeparation;

        drippingCoeffs
        {
            deltaStable 5e-4;

            minParticlesPerParcel 10;

            parcelDistribution
            {
                type            RosinRammler;
                Q               0;
                min             1e-3;
                max             2e-3;
                d               7.5e-05;
                n               0.5;
            }
        }

        BrunDrippingCoeffs
        {
            deltaStable 5e-4;

            dCoeff      1;
        }

        curvatureSeparationCoeffs
        {
            deltaStable 5e-4;
        }
    }
}

// ************************************************************************* //
